tap "ammarabouzor/tui-journal"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "koekeishiya/formulae"
brew "aria2"
brew "git"
brew "asdf"
brew "btop"
brew "cocoapods"
brew "curl"
brew "direnv"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghostscript"
brew "go"
brew "gomplate"
brew "graphviz"
brew "grep"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "ollama", restart_service: :changed
brew "openjdk"
brew "openjdk@17"
brew "pkgconf"
brew "plantuml"
brew "pngpaste"
brew "pnpm"
brew "python@3.11"
brew "ripgrep"
brew "starship"
brew "switchaudio-osx"
brew "task"
brew "taskwarrior-tui"
brew "tectonic"
brew "terraform-local"
brew "watchman"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "ammarabouzor/tui-journal/tui-journal"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "android-studio"
cask "dbeaver-community"
cask "docker-desktop"
cask "figma"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "iina"
cask "logi-options+"
cask "monitorcontrol"
cask "notion"
cask "postman"
cask "qbittorrent"
cask "rar"
cask "raycast"
cask "sf-symbols"
cask "slack"
cask "surfshark"
cask "ultimaker-cura"
cask "via"
cask "visual-studio-code"
cask "vlc"
cask "wezterm@nightly"
cask "whatsapp"
cask "zed"
cask "zen"
cask "zoom"
vscode "anthropic.claude-code"
vscode "catppuccin.catppuccin-vsc"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "jebbs.plantuml"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
vscode "prisma.prisma"
vscode "shd101wyy.markdown-preview-enhanced"
cargo "audio_recorder"
