tap "ammarabouzor/tui-journal"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
brew "aria2"
brew "btop"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "ghostscript"
brew "git"
brew "go"
brew "grep"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "luarocks"
brew "yt-dlp"
brew "mpv"
brew "neovim"
brew "ollama", restart_service: :changed
brew "pngpaste"
brew "python@3.11"
brew "ripgrep"
brew "starship"
brew "switchaudio-osx"
brew "task"
brew "taskwarrior-tui"
brew "tectonic"
brew "ammarabouzor/tui-journal/tui-journal"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "cursor"
cask "docker-desktop"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono-nerd-font-ligaturized"
cask "font-sf-pro"
cask "iina"
cask "logi-options+"
cask "monitorcontrol"
cask "notion"
cask "obs"
cask "qbittorrent"
cask "rar"
cask "raycast"
cask "sf-symbols"
cask "surfshark"
cask "unity-hub"
cask "visual-studio-code"
cask "vlc"
cask "wezterm@nightly"
cask "whatsapp"
cask "zen"
cask "zoom"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
